[
  {
    "source": "Yahoo Finance",
    "stock_symbol": "AAPL",
    "title": "Warren Buffett Is Still Holding His Apple Stock: Should You?\n\nWarren Buffett has stopped trimming his Apple (NASDAQ: AAPL) position. The billionaire from Omaha kept his largest position for Berkshire Hathaway unchanged in the fourth quarter after dumping most of his ownership in the first three quarters of 2024. Buffett is giving the signal to the market that he intends to keep his ownership position in Apple, just at a reduced size, indicating that he is bullish on the stock's future.",
    "main_text": "LIVE\nCanada retaliates, places tariffs on $107 billion of US imports\nWarren Buffett Is Still Holding His Apple Stock: Should You?\nBrett Schafer, The Motley Fool\nMon, Mar 3, 2025, 9:15 AM 5 min read\nIn This Article:\nAAPL\n-1.58%\n\nWarren Buffett has stopped trimming his Apple (NASDAQ: AAPL) position. The billionaire from Omaha kept his largest position for Berkshire Hathaway unchanged in the fourth quarter after dumping most of his ownership in the first three quarters of 2024. Apple remains Berkshire Hathaway's largest equity investment, worth $75 billion as of this writing.\n\nBuffett is giving the signal to the market that he intends to keep his ownership position in Apple, just at a reduced size, indicating that he is bullish on the stock's future. Does that mean you should keep holding on to your Apple shares? Or is now a good time to dump the megacap stock and buy something else?\n\nLet's take a closer look at this technology giant and find out.\n\nReturn to revenue growth\n\nApple is one o...",
    "published_at": "2025-03-03T14:15:00.000Z",
    "published_date": "2025-03-03",
    "url": "https://finance.yahoo.com/news/warren-buffett-still-holding-apple-141500007.html"
  },
  {
    "source": "Yahoo Finance",
    "stock_symbol": "AAPL",
    "title": "Prediction: 3 Stocks That'll Be Worth More Than Apple 5 Years From Now\n\nApple (NASDAQ: AAPL) is the world's largest company by market capitalization, so it takes a lot for companies to surpass it in terms of valuation. The number of companies in a position to pass Apple is relatively few, based solely on Apple's sheer $3.6 trillion valuation.",
    "main_text": "LIVE\nCanada retaliates, places tariffs on $107 billion of US imports\nPrediction: 3 Stocks That'll Be Worth More Than Apple 5 Years From Now\nKeithen Drury, The Motley Fool\nMon, Mar 3, 2025, 6:45 AM 4 min read\nIn This Article:\nAAPL\n-1.58%\nNVDA\nMSFT\nGOOG\n\nApple (NASDAQ: AAPL) is the world's largest company by market capitalization, so it takes a lot for companies to surpass it in terms of valuation. However, I think that it's possible. The number of companies in a position to pass Apple is relatively few, based solely on Apple's sheer $3.6 trillion valuation. However, I think that three companies are primed to do it.\n\nThese three are Nvidia (NASDAQ: NVDA), Microsoft (NASDAQ: MSFT), and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL). This trio should come as no surprise, as they are the second-, third-, and fifth-largest companies by market cap in the world.\n\nSo, how will this trio surpass Apple in five years? Simple! Growth.\n\nApple's lack of growth opened the door for other companies\n\nApple hasn...",
    "published_at": "2025-03-03T11:45:00.000Z",
    "published_date": "2025-03-03",
    "url": "https://finance.yahoo.com/news/prediction-3-stocks-thatll-worth-114500965.html"
  },
  {
    "source": "Yahoo Finance",
    "stock_symbol": "AAPL",
    "title": "Warren Buffett Has Sold Over 950 Million Shares of Apple and Bank of America. But the Billionaire Has Made a Killing on 1 Stock He Hasn't Touched in 27 Years\n\n2024 turned out to be a bit of an odd year for Warren Buffett and his company Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B). Berkshire's stock performed well, with class B shares generating a 27% return and beating the broader market's 23% return. Berkshire hoarded cash, was a net seller of stocks, and sold big parts of two of its largest positions -- Apple (NASDAQ: AAPL) and Bank of America (NYSE: BAC).",
    "main_text": "LIVE\nCanada retaliates, places tariffs on $107 billion of US imports\nWarren Buffett Has Sold Over 950 Million Shares of Apple and Bank of America. But the Billionaire Has Made a Killing on 1 Stock He Hasn't Touched in 27 Years\nBram Berkowitz, The Motley Fool\nMon, Mar 3, 2025, 6:21 AM 5 min read\nIn This Article:\nAAPL\n-1.58%\nBAC\nAXP\n\n2024 turned out to be a bit of an odd year for Warren Buffett and his company Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B). Berkshire's stock performed well, with class B shares generating a 27% return and beating the broader market's 23% return.\n\nHowever, Buffett made many moves indicating that he views the market, or at least broad swaths of the market, as overvalued. Berkshire hoarded cash, was a net seller of stocks, and sold big parts of two of its largest positions -- Apple (NASDAQ: AAPL) and Bank of America (NYSE: BAC). Yet Berkshire didn't touch shares of one of its largest longtime holdings, which it's made a killing on.\n\nSelling Apple and Bank of...",
    "published_at": "2025-03-03T11:21:00.000Z",
    "published_date": "2025-03-03",
    "url": "https://finance.yahoo.com/news/warren-buffett-sold-over-950-112100540.html"
  }
]